dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
devboard_nrf52840.name=Generic nRF52840 Dev Board (experimental - official DK uses SWD/J-Link)
devboard_nrf52840.upload.tool=niusdfu
devboard_nrf52840.upload.tool.default=niusdfu
devboard_nrf52840.upload.use_1200bps_touch=true
devboard_nrf52840.upload.wait_for_upload_port=true
devboard_nrf52840.upload.enter_bootloader_only=false
devboard_nrf52840.upload.protocol=dfu
devboard_nrf52840.upload.usb_vid=auto
devboard_nrf52840.upload.usb_pid=auto
devboard_nrf52840.upload.dfu_alt=0
devboard_nrf52840.upload.bootloader_mode=auto
devboard_nrf52840.upload.uf2_family_id=
devboard_nrf52840.upload.uf2_app_start=0x0
devboard_nrf52840.upload.uf2_volume_label=
devboard_nrf52840.upload.uf2_model=
devboard_nrf52840.upload.uf2_board_id=
devboard_nrf52840.build.openocdscript=nrf52-cmsis-dap.cfg
devboard_nrf52840.upload.maximum_size=1032192
devboard_nrf52840.upload.maximum_data_size=262144
devboard_nrf52840.build.mcu=cortex-m4
devboard_nrf52840.build.f_cpu=64000000L
devboard_nrf52840.build.board=NRF52_DEV_840
devboard_nrf52840.build.core=arduino
devboard_nrf52840.build.variant=devboard_nrf52840
devboard_nrf52840.build.ldscript=nrf52840.ld
devboard_nrf52840.build.usb_product="nRF52840 Development Board"
devboard_nrf52840.build.base_flags=-DARDUINO_NRF52_DEVBOARD -DNRF_BOARD_HAS_NATIVE_USB=1 -DNRF_BOARD_HAS_BATTERY=0 -DNRF_BOARD_HAS_WIFI=0 -DNRF_BOARD_HAS_IMU=0 -DNRF_BOARD_HAS_NFC=1
devboard_nrf52840.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=0
devboard_nrf52840.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
devboard_nrf52840.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
devboard_nrf52840.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
devboard_nrf52840.build.bootloader_app_start=0x0
devboard_nrf52840.build.flash_flags=-DNRF_BOARD_HAS_QSPI=1 -DNRF_BOARD_FLASH_PROFILE=5 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
devboard_nrf52840.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
devboard_nrf52840.build.debug_flags=
devboard_nrf52840.build.profile_flags=-DNRF_BUILD_PROFILE=0
devboard_nrf52840.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1
devboard_nrf52840.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
devboard_nrf52840.build.storage_reserved_bytes=16384
devboard_nrf52840.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.bootloader_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
devboard_nrf52840.menu.usbcdc.enabled=Enabled (Serial Monitor)
devboard_nrf52840.menu.usbcdc.enabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
devboard_nrf52840.menu.usbcdc.disabled=Disabled (no Serial Monitor)
devboard_nrf52840.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
devboard_nrf52840.menu.flashprofile.qspi8m=Internal 1 MB + QSPI 8 MB (DK modeled)
devboard_nrf52840.menu.flashprofile.qspi8m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=1 -DNRF_BOARD_FLASH_PROFILE=5 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
devboard_nrf52840.menu.flashprofile.internal1m=Internal flash only (1 MB) (no external flash)
devboard_nrf52840.menu.flashprofile.internal1m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
devboard_nrf52840.menu.ramprofile.sram256=Built-in RAM (256 KB)
devboard_nrf52840.menu.ramprofile.sram256.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
devboard_nrf52840.menu.uploadmode.usb=USB bootloader (DFU/UF2, recommended)
devboard_nrf52840.menu.uploadmode.usb.upload.tool=niusdfu
devboard_nrf52840.menu.uploadmode.usb.upload.tool.default=niusdfu
devboard_nrf52840.menu.uploadmode.usb.upload.protocol=dfu
devboard_nrf52840.menu.uploadmode.usb.upload.use_1200bps_touch=true
devboard_nrf52840.menu.uploadmode.usb.upload.wait_for_upload_port=true
devboard_nrf52840.menu.uploadmode.usb.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
devboard_nrf52840.menu.uploadmode.uf2boot=Enter UF2 drive only (no upload)
devboard_nrf52840.menu.uploadmode.uf2boot.upload.tool=niusdfu
devboard_nrf52840.menu.uploadmode.uf2boot.upload.tool.default=niusdfu
devboard_nrf52840.menu.uploadmode.uf2boot.upload.protocol=dfu
devboard_nrf52840.menu.uploadmode.uf2boot.upload.use_1200bps_touch=true
devboard_nrf52840.menu.uploadmode.uf2boot.upload.wait_for_upload_port=true
devboard_nrf52840.menu.uploadmode.uf2boot.upload.enter_bootloader_only=true
devboard_nrf52840.menu.uploadmode.uf2boot.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
devboard_nrf52840.menu.uploadmode.swd=SWD programmer (CMSIS-DAP/OpenOCD)
devboard_nrf52840.menu.uploadmode.swd.upload.tool=niusopenocd
devboard_nrf52840.menu.uploadmode.swd.upload.tool.default=niusopenocd
devboard_nrf52840.menu.uploadmode.swd.upload.protocol=swd
devboard_nrf52840.menu.uploadmode.swd.upload.use_1200bps_touch=false
devboard_nrf52840.menu.uploadmode.swd.upload.wait_for_upload_port=false
devboard_nrf52840.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
devboard_nrf52840.menu.bootloader.auto=Auto-detect (recommended)
devboard_nrf52840.menu.bootloader.auto.upload.bootloader_mode=auto
devboard_nrf52840.menu.bootloader.auto.upload.usb_vid=auto
devboard_nrf52840.menu.bootloader.auto.upload.usb_pid=auto
devboard_nrf52840.menu.bootloader.auto.upload.uf2_family_id=
devboard_nrf52840.menu.bootloader.auto.upload.uf2_app_start=0x0
devboard_nrf52840.menu.bootloader.auto.upload.uf2_volume_label=
devboard_nrf52840.menu.bootloader.auto.upload.uf2_model=
devboard_nrf52840.menu.bootloader.auto.upload.uf2_board_id=
devboard_nrf52840.menu.bootloader.auto.upload.maximum_size=1032192
devboard_nrf52840.menu.bootloader.auto.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
devboard_nrf52840.menu.bootloader.auto.build.bootloader_app_start=0x0
devboard_nrf52840.menu.bootloader.nordicdfu=Nordic USB DFU (dfu-util) (0x1915:0x5280)
devboard_nrf52840.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
devboard_nrf52840.menu.bootloader.nordicdfu.upload.uf2_family_id=
devboard_nrf52840.menu.bootloader.nordicdfu.upload.uf2_app_start=0x0
devboard_nrf52840.menu.bootloader.nordicdfu.upload.uf2_volume_label=
devboard_nrf52840.menu.bootloader.nordicdfu.upload.uf2_model=
devboard_nrf52840.menu.bootloader.nordicdfu.upload.uf2_board_id=
devboard_nrf52840.menu.bootloader.nordicdfu.upload.maximum_size=1032192
devboard_nrf52840.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
devboard_nrf52840.menu.bootloader.nordicdfu.build.bootloader_app_start=0x0
devboard_nrf52840.menu.bootloader.nicenano=nice!nano v2 UF2 mass storage
devboard_nrf52840.menu.bootloader.nicenano.upload.bootloader_mode=uf2
devboard_nrf52840.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
devboard_nrf52840.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
devboard_nrf52840.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
devboard_nrf52840.menu.bootloader.nicenano.upload.uf2_model=nice!nano
devboard_nrf52840.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
devboard_nrf52840.menu.bootloader.nicenano.upload.maximum_size=876544
devboard_nrf52840.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
devboard_nrf52840.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
devboard_nrf52840.menu.bootloader.xiaouf2=Seeed XIAO UF2 mass storage
devboard_nrf52840.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
devboard_nrf52840.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
devboard_nrf52840.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
devboard_nrf52840.menu.bootloader.xiaouf2.upload.uf2_volume_label=
devboard_nrf52840.menu.bootloader.xiaouf2.upload.uf2_model=
devboard_nrf52840.menu.bootloader.xiaouf2.upload.uf2_board_id=
devboard_nrf52840.menu.bootloader.xiaouf2.upload.maximum_size=872448
devboard_nrf52840.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
devboard_nrf52840.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
devboard_nrf52840.menu.bootloader.makerdiaryuf2=MakerDiary UF2 mass storage
devboard_nrf52840.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
devboard_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
devboard_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x1000
devboard_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=UF2BOOT
devboard_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_model=
devboard_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=
devboard_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_size=1028096
devboard_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
devboard_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x1000
devboard_nrf52840.menu.buildprofile.release=Release (smaller/faster, -Os)
devboard_nrf52840.menu.buildprofile.release.compiler.optimization_flags=-Os
devboard_nrf52840.menu.buildprofile.release.build.debug_flags=
devboard_nrf52840.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
devboard_nrf52840.menu.buildprofile.debug=Debug symbols (-Og -g3)
devboard_nrf52840.menu.buildprofile.debug.compiler.optimization_flags=-Og
devboard_nrf52840.menu.buildprofile.debug.build.debug_flags=-g3
devboard_nrf52840.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
devboard_nrf52840.menu.buildprofile.usbgdbstub=Arduino IDE Debug over USB CDC (GDB stub)
devboard_nrf52840.menu.buildprofile.usbgdbstub.compiler.optimization_flags=-Og
devboard_nrf52840.menu.buildprofile.usbgdbstub.build.debug_flags=-g3
devboard_nrf52840.menu.buildprofile.usbgdbstub.build.profile_flags=-DNRF_BUILD_PROFILE=2 -DNRF_SYSTEM_USB_GDB_STUB=1
devboard_nrf52840.menu.storage.log=Wear leveling (recommended)
devboard_nrf52840.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
devboard_nrf52840.menu.storage.log.build.storage_reserved_bytes=16384
devboard_nrf52840.menu.storage.legacy=Single page (legacy)
devboard_nrf52840.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=16384
devboard_nrf52840.menu.storage.legacy.build.storage_reserved_bytes=16384

devboard_nrf52833.name=Generic nRF52833 Development Board
devboard_nrf52833.upload.tool=niusopenocd
devboard_nrf52833.upload.tool.default=niusopenocd
devboard_nrf52833.build.openocdscript=nrf52-cmsis-dap.cfg
devboard_nrf52833.upload.maximum_size=516096
devboard_nrf52833.upload.maximum_data_size=131072
devboard_nrf52833.build.mcu=cortex-m4
devboard_nrf52833.build.f_cpu=64000000L
devboard_nrf52833.build.board=NRF52_DEV_833
devboard_nrf52833.build.core=arduino
devboard_nrf52833.build.variant=devboard_nrf52833
devboard_nrf52833.build.ldscript=nrf52833.ld
devboard_nrf52833.build.usb_product="nRF52833 Development Board"
devboard_nrf52833.build.base_flags=-DARDUINO_NRF52_DEVBOARD_833 -DNRF_BOARD_HAS_NATIVE_USB=0 -DNRF_BOARD_HAS_BATTERY=0 -DNRF_BOARD_HAS_WIFI=0 -DNRF_BOARD_HAS_IMU=0 -DNRF_BOARD_HAS_NFC=1
devboard_nrf52833.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=0
devboard_nrf52833.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
devboard_nrf52833.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
devboard_nrf52833.build.bootloader_app_start=0x0
devboard_nrf52833.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=1 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
devboard_nrf52833.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=1 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
devboard_nrf52833.build.debug_flags=
devboard_nrf52833.build.profile_flags=-DNRF_BUILD_PROFILE=0
devboard_nrf52833.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=0
devboard_nrf52833.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=8192
devboard_nrf52833.build.storage_reserved_bytes=8192
devboard_nrf52833.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
devboard_nrf52833.menu.usbcdc.disabled=Unavailable (no native USB)
devboard_nrf52833.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
devboard_nrf52833.menu.flashprofile.internal512k=Internal flash only (512 KB)
devboard_nrf52833.menu.flashprofile.internal512k.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=1 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
devboard_nrf52833.menu.ramprofile.sram128=Built-in RAM (128 KB)
devboard_nrf52833.menu.ramprofile.sram128.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=1 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
devboard_nrf52833.menu.buildprofile.release=Release (smaller/faster, -Os)
devboard_nrf52833.menu.buildprofile.release.compiler.optimization_flags=-Os
devboard_nrf52833.menu.buildprofile.release.build.debug_flags=
devboard_nrf52833.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
devboard_nrf52833.menu.buildprofile.debug=Debug symbols (-Og -g3)
devboard_nrf52833.menu.buildprofile.debug.compiler.optimization_flags=-Og
devboard_nrf52833.menu.buildprofile.debug.build.debug_flags=-g3
devboard_nrf52833.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
devboard_nrf52833.menu.storage.log=Wear leveling (recommended)
devboard_nrf52833.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=8192
devboard_nrf52833.menu.storage.log.build.storage_reserved_bytes=8192
devboard_nrf52833.menu.storage.legacy=Single page (legacy)
devboard_nrf52833.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=8192
devboard_nrf52833.menu.storage.legacy.build.storage_reserved_bytes=8192

